request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://foodmenu.io/gt/webservice">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getRoomRequest>
            <gs:number>101</gs:number>
        </gs:getRoomRequest>
    </soapenv:Body>
</soapenv:Envelope>